Tekla.Structures.TeklaStructuresInfo
The TeklaStructuresInfo class provides information about Tekla Structures.

Tekla.Structures.TeklaStructuresInfo.GetCurrentProgramVersion
Returns the current Tekla Structures version.
Returns: The current version of Tekla Structures.

Tekla.Structures.TeklaStructuresInfo.GetBuildNumber
Returns the Tekla Structures build number.
Returns: The current buildnumber of Tekla Structures.

Tekla.Structures.TeklaStructuresInfo.GetRevisionDate
Returns the Tekla Structures revision date as string.
Returns: The current revision date of Tekla Structures.

Tekla.Structures.TeklaStructuresInfo.GetCopyRightText
Returns the Tekla Structures copyright text as string.
Returns: The current copyright text of Tekla Structures.

Tekla.Structures.TeklaStructuresInfo.GetLocalAppDataFolder
Returns (XSUSERDATADIR) user's local appdata folder of the Tekla Structures as string.
Returns: The (XSUSERDATADIR)user's local appdata folder of the Tekla Structures.

Tekla.Structures.TeklaStructuresInfo.GetCommonAppDataFolder
Returns (XSDATADIR)environments installation folder of the Tekla Structures as string.
Returns: The (XSDATADIR)environments installation folder of the Tekla Structures.

Tekla.Structures.TeklaStructuresInfo.GetFullTSRegistryKeyText
Returns full registry key of the Tekla Structures as string.
Returns: The full registry key of the Tekla Structures.

Tekla.Structures.TeklaStructuresInfo.GetCurrentUser
Returns the current Tekla Structures user.
Returns: The current user of Tekla Structures.